neovim/configs/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Neovim Configuration Modules</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Neovim Configuration Modules</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8768f30">1. Overview</a></li>
<li><a href="#org8e2b00e">2. File Structure</a></li>
<li><a href="#org9c38f10">3. Configuration Architecture</a></li>
<li><a href="#org5c3d5c8">4. Usage</a></li>
<li><a href="#orgd853b67">5. Features</a>
<ul>
<li><a href="#orga4f5124">5.1. Core Features</a></li>
<li><a href="#orgcb751a4">5.2. Key Mappings</a></li>
<li><a href="#orgb3ef47f">5.3. Language Support (via LSP)</a></li>
<li><a href="#org8474e03">5.4. Plugin Ecosystem</a></li>
</ul>
</li>
<li><a href="#org42460bb">6. Dependencies</a></li>
<li><a href="#orgc2f2996">7. Directory Structure</a></li>
<li><a href="#org13b5e9d">8. Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8768f30" class="outline-2">
<h2 id="org8768f30"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This directory contains modular Neovim configuration files, organized from a single <code>init.lua</code> configuration into structured Org-mode files for better documentation and maintainability.
</p>
</div>
</div>

<div id="outline-container-org8e2b00e" class="outline-2">
<h2 id="org8e2b00e"><span class="section-number-2">2.</span> File Structure</h2>
<div class="outline-text-2" id="text-2">
<p>
Each configuration module is a separate Org file:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Tangles To</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>01-init.org</code></td>
<td class="org-left">Core Neovim settings and basic configuration</td>
<td class="org-left"><code>~/.config/nvim/init.lua</code></td>
</tr>

<tr>
<td class="org-left"><code>02-keybindings.org</code></td>
<td class="org-left">All keybindings and mappings</td>
<td class="org-left"><code>~/.config/nvim/init.lua</code> (appended)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9c38f10" class="outline-2">
<h2 id="org9c38f10"><span class="section-number-2">3.</span> Configuration Architecture</h2>
<div class="outline-text-2" id="text-3">
<p>
The configuration is structured to follow Neovim's Lua-based configuration approach:
</p>

<ul class="org-ul">
<li><b>Core Settings</b>: Basic vim options, display settings, file handling</li>
<li><b>Keybindings</b>: Organized by mode (normal, visual, insert, command)</li>
<li><b>LSP Configuration</b>: Language Server Protocol setup for various languages</li>
<li><b>Plugins</b>: Plugin management and configuration</li>
<li><b>Autocommands</b>: Event-driven configurations</li>
</ul>
</div>
</div>

<div id="outline-container-org5c3d5c8" class="outline-2">
<h2 id="org5c3d5c8"><span class="section-number-2">4.</span> Usage</h2>
<div class="outline-text-2" id="text-4">
<p>
To tangle these configuration files into your Neovim config:
</p>

<ol class="org-ol">
<li>Open the desired org file in Emacs</li>
<li>Run <code>C-c C-v t</code> (or <code>M-x org-babel-tangle</code>)</li>
<li>The configuration will be written to <code>~/.config/nvim/</code></li>
</ol>

<p>
Alternatively, you can tangle all files at once using a script or batch command.
</p>
</div>
</div>

<div id="outline-container-orgd853b67" class="outline-2">
<h2 id="orgd853b67"><span class="section-number-2">5.</span> Features</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga4f5124" class="outline-3">
<h3 id="orga4f5124"><span class="section-number-3">5.1.</span> Core Features</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Suckless philosophy: minimal, efficient configuration</li>
<li>Transparent background support</li>
<li>Smart indentation and search settings</li>
<li>Persistent undo with dedicated directory</li>
<li>System clipboard integration</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb751a4" class="outline-3">
<h3 id="orgcb751a4"><span class="section-number-3">5.2.</span> Key Mappings</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Space as leader key</li>
<li>Emacs-style navigation in insert mode</li>
<li>Buffer and window management shortcuts</li>
<li>Visual mode enhancements</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3ef47f" class="outline-3">
<h3 id="orgb3ef47f"><span class="section-number-3">5.3.</span> Language Support (via LSP)</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Lua (lua-language-server)</li>
<li>Markdown (markdown-oxide, marksman)</li>
<li>Python (pyright)</li>
<li>Web technologies (HTML, CSS, JavaScript, TypeScript)</li>
<li>Ruby (ruby-lsp)</li>
<li>Java (jdtls)</li>
<li>XML (lemminx)</li>
</ul>
</div>
</div>

<div id="outline-container-org8474e03" class="outline-3">
<h3 id="org8474e03"><span class="section-number-3">5.4.</span> Plugin Ecosystem</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>Telescope for fuzzy finding</li>
<li>Treesitter for syntax highlighting</li>
<li>nvim-cmp for completion</li>
<li>Mason for LSP management</li>
<li>Neo-tree for file exploration</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org42460bb" class="outline-2">
<h2 id="org42460bb"><span class="section-number-2">6.</span> Dependencies</h2>
<div class="outline-text-2" id="text-6">
<p>
External tools needed for full functionality:
</p>

<ul class="org-ul">
<li><code>lua-language-server</code> - Lua LSP</li>
<li><code>pyright</code> - Python LSP</li>
<li><code>typescript-language-server</code> - TypeScript/JavaScript LSP</li>
<li><code>vscode-langservers-extracted</code> - HTML/CSS/JSON LSPs</li>
<li><code>markdown-oxide</code> - Markdown LSP with preview</li>
<li><code>marksman</code> - Additional Markdown support</li>
<li><code>ruby-lsp</code> - Ruby language server</li>
</ul>

<p>
Install these via your package manager or the recommended installation method for each tool.
</p>
</div>
</div>

<div id="outline-container-orgc2f2996" class="outline-2">
<h2 id="orgc2f2996"><span class="section-number-2">7.</span> Directory Structure</h2>
<div class="outline-text-2" id="text-7">
<pre class="example" id="orge153f3d">
~/.config/nvim/
├── init.lua                 # Main configuration file
├── lua/
│   └── pengling/           # Custom namespace
│       ├── plugins/        # Plugin configurations
│       │   ├── init.lua
│       │   ├── treesitter.lua
│       │   ├── telescope.lua
│       │   ├── cmp.lua
│       │   └── theme.lua
│       └── utils/          # Utility functions
│           └── douzone.lua
└── ftplugin/              # Filetype-specific settings
    ├── java.lua
    └── markdown.lua
</pre>
</div>
</div>

<div id="outline-container-org13b5e9d" class="outline-2">
<h2 id="org13b5e9d"><span class="section-number-2">8.</span> Notes</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>The configuration uses <code>vim.pack.add</code> for native package management</li>
<li>Folding is configured to use Treesitter expressions</li>
<li>Terminal mode includes a custom floating terminal implementation</li>
<li>The configuration maintains compatibility with both GUI and terminal Neovim</li>
</ul>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-12-01</p>
</footer>
</body>
</html>
